package ru.star.springbankstar.model;

public class OfferDescriptionText {

    private String TEXT_INVEST_500 = "Откройте свой путь к успеху с индивидуальным инвестиционным " +
            "счетом (ИИС) от нашего банка! Воспользуйтесь налоговыми льготами и начните инвестировать " +
            "с умом. Пополните счет до конца года и получите выгоду в виде вычета на взнос в следующем " +
            "налоговом периоде. Не упустите возможность разнообразить свой портфель, снизить риски и " +
            "следить за актуальными рыночными тенденциями. Откройте ИИС сегодня и станьте ближе к финансовой независимости!";

    public String getTEXT_INVEST_500() {
        return TEXT_INVEST_500;
    }
    /*
    Прописать предлодения для клиентов
     */
}
