package ru.star.springbankstar.model;

public class OfferDescriptionText {

    private String TEXT_INVEST_500 = "Откройте свой путь к успеху с индивидуальным инвестиционным " +
            "счетом (ИИС) от нашего банка! Воспользуйтесь налоговыми льготами и начните инвестировать " +
            "с умом. Пополните счет до конца года и получите выгоду в виде вычета на взнос в следующем " +
            "налоговом периоде. Не упустите возможность разнообразить свой портфель, снизить риски и " +
            "следить за актуальными рыночными тенденциями. Откройте ИИС сегодня и станьте ближе к финансовой независимости!";

    public String getTEXT_INVEST_500() {
        return TEXT_INVEST_500;
    }


    private String TOP_SAVING = "Откройте свою собственную «Копилку» с нашим банком! " +
        "«Копилка» — это уникальный банковский инструмент, который поможет вам легко и удобно накапливать деньги на важные цели. " +
            "Больше никаких забытых чеков и потерянных квитанций — всё под контролем! " +
    "Преимущества «Копилки»: " +
    "Накопление средств на конкретные цели. Установите лимит и срок накопления, и банк будет автоматически переводить определенную сумму на ваш счет. " +
    "Прозрачность и контроль. Отслеживайте свои доходы и расходы, контролируйте процесс накопления и корректируйте стратегию при необходимости. " +
    "Безопасность и надежность. Ваши средства находятся под защитой банка, а доступ к ним возможен только через мобильное приложение или интернет-банкинг. " +
    "Начните использовать «Копилку» уже сегодня и станьте ближе к своим финансовым целям! ";

    public String getTOP_SAVING() {
        return TOP_SAVING;
    }
    /*
    Прописать предлодения для клиентов
     */
}
