package ru.star.springbankstar.model;

public class OfferDescriptionText {
    private String TEXT_INVEST_500 = "Откройте свой путь к успеху с индивидуальным инвестиционным " +
            "счетом (ИИС) от нашего банка! Воспользуйтесь налоговыми льготами и начните инвестировать " +
            "с умом. Пополните счет до конца года и получите выгоду в виде вычета на взнос в следующем " +
            "налоговом периоде. Не упустите возможность разнообразить свой портфель, снизить риски и " +
            "следить за актуальными рыночными тенденциями. Откройте ИИС сегодня и станьте ближе к финансовой независимости!";

    private static final String TEXT_EASY_CREDIT = "Откройте мир выгодных кредитов с нами!\n" +
            "\n" +
            "Ищете способ быстро и без лишних хлопот получить нужную сумму? Тогда наш выгодный кредит — " +
            "именно то, что вам нужно! Мы предлагаем низкие процентные ставки, гибкие условия и " +
            "индивидуальный подход к каждому клиенту.\n" +
            "\n" +
            "Почему выбирают нас:\n" +
            "\n" +
            "Быстрое рассмотрение заявки. Мы ценим ваше время, поэтому процесс рассмотрения заявки " +
            "занимает всего несколько часов.\n" +
            "\n" +
            "Удобное оформление. Подать заявку на кредит можно онлайн на нашем сайте " +
            "или в мобильном приложении.\n" +
            "\n" +
            "Широкий выбор кредитных продуктов. Мы предлагаем кредиты на различные цели: " +
            "покупку недвижимости, автомобиля, образование, лечение и многое другое.\n" +
            "\n" +
            "Не упустите возможность воспользоваться выгодными условиями кредитования от нашей компании!";

    public String getTEXT_INVEST_500() {
        return TEXT_INVEST_500;
    }

    public String getTEXT_EASY_CREDIT() {
        return TEXT_EASY_CREDIT;
    }

    /*
    Прописать предлодения для клиентов
     */
}
